app/controllers/api/datasources_controller.rb

    def index
        datasources = Datasource.all
        datasources = datasources.map do |datasource|
---
SELECT "datasources".* FROM "datasources"

    def create
        datasource = Datasource.create!(datasource_params)
---
INSERT INTO "datasources" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "CCLE"], ["created_at", "2021-05-02 23:39:09.757673"], ["updated_at", "2021-05-02 23:39:09.757673"]]