app/controllers/api/experiments_controller.rb

SELECT "experiments".* FROM "experiments" INNER JOIN "datasources" ON "datasources"."id" = "experiments"."datasource_id" INNER JOIN "genes" ON "genes"."id" = "experiments"."gene_id" WHERE "datasources"."name" = $1 AND "genes"."name" = $2  [["name", "NCI60"], ["name", "MIR19A"]]
SELECT "experiments".* FROM "experiments" INNER JOIN "genes" ON "genes"."id" = "experiments"."gene_id" WHERE "genes"."name" = $1  [["name", "RNU7-63P"]]
SELECT "experiments".* FROM "experiments"
SELECT "lines".* FROM "lines" WHERE "lines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        experiments1 = Experiment.none
        experiments = Experiment.none
        experiments2 = Experiment.none
        experiments0 = Experiment.nones
        req_body = request.body.read()

        begin
            hash_body = JSON.parse req_body

            hash_body.keys.each { |key|
                instance_variable_set("@#{key.downcase}_body", hash_body[key])
            }

            @datasource_body.each { |datasource|
                experiments1 += experiments0.joins(:datasource).where(:datasources => {:name=>datasource})
            }


            @gene_body.each { |gene|
                experiments2 += experiments1.joins(:gene).where(:genes => {:name=>gene})
                puts ("HOLIS")
                puts(gene)
            }

            puts (experiments)
            @line_body.each{ |line|
                puts (line)
                #experiments = experiments.joins(:line).where(:lines => {:name=>line})
                experiments += experiments2.select{ |experiment| experiment.line.name == line }

INSERT INTO "experiments" ("copy_number", "expression", "datasource_id", "line_id", "gene_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["copy_number", 2.1], ["expression", 4.89], ["datasource_id", 3], ["line_id", 2], ["gene_id", 1], ["created_at", "2021-05-20 02:41:32.549002"], ["updated_at", "2021-05-20 02:41:32.549002"]]
---
    def create
        experiment = Experiment.create!(experiment_params)