app/controllers/api/genes_controller.rb

    def create
        gene = Gene.create!(gene_params)
---
INSERT INTO "genes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "OR4"], ["created_at", "2021-05-02 23:38:41.605154"], ["updated_at", "2021-05-02 23:38:41.605154"]]