app/controllers/api/lines_controller.rb

SELECT "lines".* FROM "lines"
---
    def index
        lines = Line.all
        lines = lines.map do |line|

INSERT INTO "lines" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "NIATEST"], ["created_at", "2021-05-02 22:26:47.749125"], ["updated_at", "2021-05-02 22:26:47.749125"]]
---
    def create
        line = Line.create!(line_params)